---
title: EdgeArrayArray
classe: Autodesk.Revit.DB.EdgeArrayArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# EdgeArrayArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `edgeArrayArray.IsEmpty` | Boolean |
| `EdgeArray Item { get; set; }` | `edgeArrayArray.Item` | EdgeArray |
| `Int32 Size { get; }` | `edgeArrayArray.Size` | Int32 |
| `Void Append(EdgeArray)` | `edgeArrayArray.Append(item)` | Void |
| `Void Clear()` | `edgeArrayArray.Clear()` | Void |
| `EdgeArrayArrayIterator ForwardIterator()` | `edgeArrayArray.ForwardIterator()` | EdgeArrayArrayIterator |
| `IEnumerator GetEnumerator()` | `edgeArrayArray.GetEnumerator()` | IEnumerator |
| `Void Insert(EdgeArray, Int32)` | `edgeArrayArray.Insert(item, index)` | Void |
| `EdgeArrayArrayIterator ReverseIterator()` | `edgeArrayArray.ReverseIterator()` | EdgeArrayArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```